blogger/app/controllers/articles_controller.rb

    def index
        @articles = Article.all
---
SELECT "articles".* FROM "articles"

    def show
        @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def create
        @article = Article.new(article_params)
        @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Testing again"], ["body", "La la la"], ["created_at", "2019-10-17 20:39:03.770378"], ["updated_at", "2019-10-17 20:39:03.770378"]]

    def destroy
        @article = Article.find(params[:id])
        @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 9]]

    def edit
        @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
        @article = Article.find(params[:id])
        @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Harry goes through puberty and Sirius dies."], ["updated_at", "2019-10-17 21:05:26.014137"], ["id", 3]]