blogger/app/controllers/tags_controller.rb

    def show
        @tag = Tag.find(params[:id])
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def index
        @tag = Tag.all
---
SELECT "tags".* FROM "tags"

    def destroy
        @tag = Tag.find(params[:id])
        @tag.destroy
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 2]]